{
  "name": "Magick Synthesis Matrix",
  "advancement": "magickcore:element_product/spirit_crystal",
  "icon": "magickcore:spirit_crystal",
  "category": "magickcore:element_product",
  "pages": [
    {
      "type": "text",
      "text": "By arranging spirit crystals in a special configuration, we can create a small-scale magical matrix known as the Magick Synthesis Matrix. It serves as the starting point for our subsequent operations."
    },
    {
      "type": "image",
      "title": "Configuration of the Synthesis Matrix",
      "images": ["magickcore:textures/book_image/magick_crafting.png"],
      "border": "true"
    },
	{
      "type": "text",
      "text": "The Magick Synthesis Matrix is a synthesis matrix capable of manipulating mana-infused materials. Its fundamental purpose is to transform items. $(br2)Currently, we need to create a container for capturing elemental energy, and its synthesis materials require the dropped items from spirit crystals. Placing the spirit crystals onto the Synthesis Matrix completes the first step of the process."
    },
    {
      "type": "image",
      "title": "Material Transmutation",
      "images": ["magickcore:textures/book_image/magick_workbench.png"],
      "text": "Elemental crystals are derived from spirit crystals. These elemental crystals maintain the stability of mana, preventing its dissipation. They are used to create containers that can store elemental energy, allowing us to collect the elemental energy scattered throughout the world.",
      "border": "true"
    },
    {
      "type": "magickcore:element_recipe",
      "item0": "minecraft:air",
      "item1": "minecraft:air",
      "item2": "minecraft:air",
      "item3": "magickcore:element_crystal",
      "item4": "minecraft:air",
      "item5": "magickcore:element_crystal",
      "item6": "minecraft:air",
      "item7": "magickcore:element_crystal",
      "item8": "minecraft:air",
      "output": "magickcore:orb_bottle",
      "text": "Synthesis of Elemental Containers"
    },
    {
      "type": "image",
      "title": "Elemental Energy",
      "images": ["magickcore:textures/book_image/element_power.png"],
      "border": "true",
      "text": "You might already be familiar with the small orbs of light that creatures drop upon death, known as elemental energy clusters. Most elemental energy from creatures, including yourself, exists in its original state, lacking practical use and distinctive properties."
    },
    {
      "type": "image",
      "title": "Elemental Creatures",
      "images": ["magickcore:textures/book_image/wither_spider.png"],
      "border": "true",
      "text": "What we need to capture are elemental energy clusters that have manifested specific elemental attributes. Original elemental energy appears as white, block-shaped clusters. $(#B22222)However, we are primarily seeking clusters with different shapes, which are dropped by creatures exhibiting particle effects in their vicinity.$()。"
    },
    {
      "type": "text",
      "text": "The elements carried by monsters are typically related to the dimension, biome, and their own characteristics. For example, cave spiders carry withered elements, creepers carry arc elements, and monsters struck by lightning transform into arc elements as well. Stand in front of elemental energy and right-click the elemental container to absorb the energy. $(br2)After absorbing the elemental energy, the container can be crafted into items related to the elements."
    },
    {
      "title": "Containers Containing Elemental Essence",
      "type": "spotlight",
      "item": "magickcore:orb_bottle{ELEMENT:\"arc\"}",
      "text": "Containers containing elemental essence can transfer their own elemental energy to sheep. Right-clicking on a sheep will transfer the elemental energy into its body. By slaying the sheep, we can harvest elemental wool. $(br2)Alternatively, we can use shears to obtain elemental wool. Elemental wool can be broken down into elemental string, which can be used to enchant weapons with elemental effects that match their properties."
    },
    {
      "type": "magickcore:element_recipe",
      "item0": "magickcore:orb_bottle{ELEMENT:\"arc\"}",
      "item1": "minecraft:string,minecraft:white_wool",
      "item2": "minecraft:air",
      "item3": "minecraft:air",
      "item4": "minecraft:air",
      "item5": "minecraft:air",
      "item6": "minecraft:air",
      "item7": "minecraft:air",
      "item8": "minecraft:air",
      "output": "magickcore:element_string{ELEMENT:\"arc\"},magickcore:element_wool{ELEMENT:\"arc\"}",
      "text": "Elemental containers can also be directly crafted with string and wool."
    },
    {
      "type": "magickcore:element_recipe",
      "item0": "magickcore:orb_bottle{ELEMENT:\"arc\"}",
      "item1": "minecraft:wheat_seeds",
      "item2": "minecraft:air",
      "item3": "minecraft:air",
      "item4": "minecraft:air",
      "item5": "minecraft:air",
      "item6": "minecraft:air",
      "item7": "minecraft:air",
      "item8": "minecraft:air",
      "output": "magickcore:element_crystal_seeds{ELEMENT:\"arc\"}",
      "text": "Elemental containers can also be crafted with seeds, allowing the harvest of elemental crystals and elemental energy through cultivation. Elemental crystals can be synthesized into elemental cores, which are used to alter the elemental properties of creatures. $(#B22222)Planting some elemental crystals will greatly aid in future spellcasting.$()。"
    }
  ]
}