{
  "name": "Spell Casting and HUD Description",
  "advancement": "magickcore:spell_learn/magick_core",
  "icon": "magickcore:magick_context",
  "category": "magickcore:intro",
  "pages": [
    {
      "type": "text",
      "text": "In the usual case, you can define the spell's element when crafting it. If the element of the spell is not specified(Origin Element), then the element of the spell will be transformed into an element that matches itself by the spirit product or the caster. $(br2)When casting spells, the mana stored in the spirit product will be used first, and when the mana in the spirit product is insufficient, the caster's own mana will be used. Molding Spell can also be named through the anvil, and the name of the Molding Spell will be displayed when the spirit product is equipped with the spell."
    },
    {
      "type": "text",
      "text": "The mana value of a creature will naturally recover, and the mana value limit can be increased by absorbing the elemental energy dropped by other creatures until the limit reaches 5000. All life has a mana value limit of 5000. $(br2)It is worth noting that players will lose a small amount of mana upon death, so try to avoid death as much as possible. "
    },
    {
      "type": "text",
      "text": "Equip Molding Spell to tools instead of synthesizing them at the workbench, you can also $(#0000FF)\"memorize\"$() Molding Spell, and then use the shortcut key to switch the Molding Spell on the tool. Hold the Molding Spell and press the R button for a long time to \"memorize\", hold the R button empty-handed to take out the last Molding Spell, and sneak empty-handed to take out three at a time. $(br2) The memorized Molding Spell can be directly held with the \"spirit product capable of installing Molding Spell\" to switch the Molding Spell on the spirit product. Hold the spirit product and press the R key to see the Molding Spell that have been memorized, and click to switch."
    },
    {
      "type": "image",
      "images": ["magickcore:textures/book_image/memory.png"],
      "border": "true",
      "text": "The memory slot on the player."
    },
    {
      "type": "text",
      "text": "By default, the player can memorize three Molding Spells, but we can obtain some materials to increase the memory capacity. $(br2) can memorize up to 6 Molding Spells by throwing $(#0000FF)spirit crystal and diamond $() together. $(br2) Throwing $(#0000FF)spirit crystal and magma cream $() together can memorize up to 9 Molding Spell. $(br2) Throw $(#0000FF)spirit crystal and chorus fruit $() together to memorize up to 12."
    },
    {
      "type": "image",
      "images": ["magickcore:textures/book_image/mana_value.png"],
      "border": "true",
      "text": "F3 to open the Debug interface, you can see the specific value of the mana value in the lower right corner, and the value above the mana value is the value of the elemental shield. But please keep in mind that the most important thing is to use the existing magic power reasonably, rather than paying too much attention to the value of the magic power."
    },
    {
      "type": "text",
      "text": "$(br2) Magic-based buffs and debuffs are different from potion status effects, and magic buffs and debuffs will be displayed on the edge of the screen. The same is true for the elemental shield effect, which will also be displayed on the edge of the screen."
    },
    {
      "type": "image",
      "images": ["magickcore:textures/book_image/shield.png"],
      "border": "true",
      "text": "For players with elemental shield energy, a silky elemental shield effect will appear on the edge of his screen."
    },
    {
      "type": "image",
      "images": ["magickcore:textures/book_image/buff.png"],
      "border": "true",
      "text": "For players with buffs, there will be a soft border around the edges of his screen."
    },
    {
      "type": "image",
      "images": ["magickcore:textures/book_image/debuff.png"],
      "border": "true",
      "text": "For the player receiving the debuff, there will be a sharp border effect around the edges of his screen."
    }
  ]
}