{
  "name": "102 Simple Spell",
  "advancement": "magickcore:spell_learn/understand_spell",
  "icon": "magickcore:context_core",
  "category": "magickcore:spell",
  "pages": [
    {
      "type": "text",
      "text": "Let's first learn how to create a simple buff spell that can give us a speed boost and a sense of urgency. First, we need to gather $(#20B2AA)an Arc Element Core, gunpowder, several sticks, several lapis lazuli, and several redstone$(). $(br2)The Arc Element Core is cultivated and synthesized using crystals from the Arc Element, which is commonly found on Creepers. Additionally, we need to synthesize a $(#0000FF)Function$() Spell Core at the Magick Synthesis Matrix."
    },
    {
      "type": "image",
      "images": ["magickcore:textures/book_image/creeper.png"],
      "border": "true",
      "text": "Arc Element of the Creeper"
    },
    {
      "type": "magickcore:element_recipe",
      "item0": "minecraft:air",
      "item1": "magickcore:spirit_wood_stick",
      "item2": "minecraft:air",
      "item3": "magickcore:spirit_wood_stick",
      "item4": "minecraft:air",
      "item5": "minecraft:air",
      "item6": "minecraft:air",
      "item7": "minecraft:air",
      "item8": "minecraft:air",
      "output": "magickcore:wand",
      "text": "First, we need to throw the sticks onto the Synthesis Matrix to transform them into Spirit Sticks, and then use the Spirit Sticks to craft a Wand. Spirit Sticks are the raw material for creating wand, and we frequently use wand in the process."
    },
    {
      "type": "magickcore:magick_recipe",
      "magick_recipe": "magickcore:context_core",
      "text": "Next, we need to right-click and place these materials on the Magick Synthesis Matrix. The materials required are Spirit Sticks and Spirit Crystals, arranged in a 2x2 grid. Once the materials are placed, use the wand to right-click on them to obtain a $(#0000FF)Function$() Spell Core."
    },
    {
      "type": "spotlight",
      "title": "Function Spell Core",
      "item": "magickcore:context_core",
      "text": "The $(#0000FF)Function Spell Core$() is a container for storing mana materials and is specifically used for crafting $(#0000FF)functional spells$(). We can throw the $(#0000FF)Function Spell Core$() on the ground, and it will rise a few blocks and unfold. $(br2)For $(#0000FF)functional spells$(), we need to throw elemental cores, $(#0000FF)application types$() materials, and other mana materials into the Function Spell Core in the form of dropped items. This will determine the $(#0000FF)function$(), $(#00CED1)force$(), $(#FFB90F)duration$(), and $(#EE6363)range$() attributes of the $(#0000FF)functional spell$()."
    },
    {
      "type": "image",
      "title": "Unfolded Function Spell Core",
      "images": ["magickcore:textures/book_image/context_core.png"],
      "text": "The unfolded $(#0000FF)Function Spell Core$() contains the materials. We can use $(#0000FF)right-click$() on the Function Spell Core to retrieve the materials or use $(#0000FF)three consecutive clicks$() on the Function Spell Core to retrieve the $(#0000FF)Function Spell Core$() itself.",
      "border": "true"
    },
    {
      "type": "text",
      "text": "The materials we have collected so far are: $(#20B2AA)Arc Element Core, gunpowder, lapis lazuli, redstone$(). The latter three need to be thrown into the Magick Synthesis Matrix to be transformed into: Mana Gunpowder, $(#00CED1)Force$() Mana Energy, and $(#FFB90F)Duration$() Mana Energy. $(br2)Mana Gunpowder is used to change the $(#0000FF)application type$() of the element, or in other words, the state of the mana element. When combined with the Arc Element, it forms Arc Buff, which has the effect of grants creature haste. $(br2)It is important to note that the Spell Core has attribute limits, and once the limit is reached, no more mana energy can be added."
    },
    {
      "type": "text",
      "text": "Mana energy corresponds to the three basic attributes of $(#0000FF)function$(): $(#00CED1)force$(), $(#EE6363)range$(), and $(#FFB90F)duration$(). For buff magic, we usually only need to increase $(#00CED1)force$() and $(#FFB90F)duration$(), which is why we need to collect lapis lazuli and redstone. $(br2)We throw the $(#20B2AA)Arc Element Core, Mana Gunpowder, and the two types of mana energy$() into the unfolded $(#0000FF)function$() Spell Core as dropped items to create a magic spell that can grants creature haste. $(br2)Finally, right-click on the unfolded spell construction with the wand to compress it into a Molding Spell. It is important to note that $(#B22222)once the Spell Core becomes a Molding Spell, it cannot be modified$()."
    }
  ]
}
