{
  "name": "103 Basic Staff",
  "advancement": "magickcore:spell_learn/magick_core",
  "icon": "magickcore:context_core",
  "category": "magickcore:spell",
  "pages": [
    {
      "type": "text",
      "text": "Congratulations! You have learned how to create a basic spell. Now you need a tool for casting spells, and the simplest casting tool is the Spirit Crystal Staff, which can be crafted at the Magick Synthesis Matrix."
    },
    {
      "type": "magickcore:magick_recipe",
      "magick_recipe": "magickcore:spirit_crystal_staff",
      "text": "The Spirit Crystal Staff requires two Spiritwood Sticks and five Spirit Crystals for synthesis. The scale is 3x3. After placing the materials, right-click with the wand to complete the synthesis."
    },
    {
      "type": "text",
      "text": "If you already have the Spirit Crystal Staff, simply combine it with a Molding Spell in your inventory to equip the spell. Equipped staffs with Molding Spells can be used for casting by right-clicking. $(br2)However, please note that the consumption of magic is closely related to the basic attributes of the spell. Increasing $(#00CED1)force$(), $(#FFB90F)duration$(), or $(#EE6363)range$() will increase the magic consumption. For most spells, $(#EE6363)range$() is the most magic-consuming attribute."
    },
    {
      "type": "text",
      "text": "At this stage, we cannot define the $(#DA70D6)form$() of magick ourselves. We can only determine the $(#DA70D6)form$() of magick through casting tools. $(br2)For the Spirit Crystal Staff, the target of the spell is ourselves. The buff spells attached to the staff will affect ourselves. If we want the spell to affect other creatures or blocks, we need to install the spell on other casting tools."
    },
    {
      "type": "spotlight",
      "item": "magickcore:spirit_sword",
      "text": "The Spirit Sword's spell targets are the entities it strikes. If we place an buff spell on the Spirit Sword, the buff effect will be applied to the targets we attack."
    },
    {
      "type": "magickcore:magick_recipe",
      "magick_recipe": "magickcore:spirit_sword",
      "text": "The Spirit Sword also needs to be crafted at the Magick Synthesis Matrix. The scale is 1x3, and the materials need to be placed in the center of the matrix. After arranging the materials, right-click with the wand to complete the synthesis."
    },
    {
      "type": "spotlight",
      "item": "magickcore:spirit_bow",
      "text": "The magick of the Spirit Bow takes the $(#DA70D6)form$() of mana arrows. When fully charged and released, it generates a magick arrow. The arrow will trigger the Molding Spell upon hitting a target. However, the mana arrows move relatively slowly, requiring some prediction to hit the target accurately."
    },
    {
      "type": "magickcore:magick_recipe",
      "magick_recipe": "magickcore:spirit_bow",
      "text": "The Spirit Bow also needs to be crafted at the Magick Synthesis Matrix. The materials also need to be aligned with the center of the matrix. If placed off-center, the synthesis cannot be completed. After arranging the materials, right-click with the wand to complete the synthesis."
    },
    {
      "type": "text",
      "text": "Now you can try using buff spells on yourself. Simply right-click with the Spirit Crystal Staff to cast the spell. With any luck, you should experience the speed boost and urgency effects brought by the Arc element."
    }
  ]
}
