{
  "name": "107 形态分类",
  "advancement": "magickcore:spell_learn/context_pointer",
  "icon": "magickcore:context_pointer",
  "category": "magickcore:spell",
  "pages": [
    {
      "type": "text",
      "title": "法术形态的三大类别",
      "text": "如果说前面的知识你已经消化完毕了，接下来我会为你介绍一些法术形态的三大分类，分别是最基础的投掷类、释放范围法术的辐射类、稳定并持续工作的点状类形态。"
    },
    {
      "type": "text",
      "title": "投掷类法术形态",
      "text": "投掷类法术形态是一种魔力传递效率很高的形态，其中一个原因是因为只有投掷类法术可以自由在世界中运动，所以投掷类法术形态可以携带后续法术到其他位置来释放，当投掷类法术形态触碰到方块时会对方块释放后续法术，触碰到实体时会把实体当作目标来释放后续法术。法术的范围属性会小幅度增加投掷类法术的体积。"
    },
    {
      "type": "text",
      "text": "投掷形态的法术通常来讲强度的魔法效益会比较高，可以很好的保留功能法术应有的强度值，这是它的优点。如果说投掷物形态在构造时使用了由劣质钻石提供的自我中心属性，那么它会变成一个跟随施法者的元素之魂，按照强度和范围属性来对周围生物投掷自身。"
    },
    {
      "type": "text",
      "text": "除此之外，投掷类法术形态在触碰到目标时，会对目标施加\"触碰类型\"的魔力流，从而带来额外的收益。$(br2)除去投掷类法术，灵魂木剑在触碰实体时也会施加\"触碰类型\"的魔力流。"
    },
    {
      "type": "text",
      "title": "辐射类法术形态",
      "text": "辐射类法术形态是一种无法移动的范围作用形态，十分依赖范围属性，可以对方块、实体进行范围的施法，对后续法术传递目标的方向，但是辐射类形态在触发之后会直接消失，对方块的作用也只发生在生成的一瞬间，之后只会判断范围内的实体，最重要的是，辐射类形态的强度魔法效益只有常规形态的一半或更少。$(br2)这使得辐射类形态不能很好的传递需要高魔力强度的法术功能。"
    },
    {
      "type": "text",
      "title": "点状类法术形态",
      "text": "点状类法术形态是一种无法移动，但通常持续存在的法术形态，有特殊的触发效果和运作方式，无法作用于方块，有的点状形态会不存在碰撞，而是起到前后法术形态的催化作用。$(br2)通常来讲点状类形态的 强度、存在时间 魔法效益只有常规数值的五分之一，所以点状类形态适合对移动频率低、移动速度慢的目标使用，通过长时间释放法术来抵消无法移动、魔法效益低的缺点。"
    },
    {
      "type": "text",
      "text": "对于任何的形态而言，在触发时所传递的位置信息是自己的中心处，这一点是非常重要的，意味着下一个法术形态会在上一个法术形态的位置处生成。如果我们需要让形态在目标的位置生成，需要衔接投掷物形态抛掷过去。"
    },
    {
      "type": "text",
      "title": "形态搭配",
      "text": "三种法术形态各自有不同的特性，我们可以根据这些形态的特性来进行搭配，发挥各自的优势。对于点状形态和辐射形态来说，我们可以在它们的前面加上投掷形态，利用投掷形态将自身带到其他的位置。对于投掷形态来讲，我们也可以在它的前面加上辐射形态，对辐射范围内的每个实体释放投掷物。"
    },
    {
      "type": "spotlight",
      "item": "magickcore:entity_type{item_extra_data:{ELEMENT:\"origin\",haveMagickContext:0b,ManaCapacity:{CAPACITY:0.0f,MAX_CAPACITY:5000.0f},FORCE:0.0f,disable:0b,CHILD_CONTEXT:{spawn:{ENTITY_TYPE:\"minecraft:zombie\"}},APPLY_TYPE:\"none\",TICK:0,RANGE:0.0f}}",
      "text": "法术形态的本质是使用魔力生成实体，携带后续法术所需的魔力来在世界中传递，施法者在施法时所需的魔力都已经传递给法术形态了，触发后续法术并不会消耗额外魔力。另外，在这个世界上是有法术形态可以抽离世界中其他生物、投掷物的形态来作为法术形态使用，只是这些生物法术形态无法传递后续法术。$(br)目前有关法术形态的知识已经讲解完了，等到你获取更多的法术形态时，书中也会解锁相应的知识。"
    }
  ]
}