{
  "name": "107 Form Classification",
  "advancement": "magickcore:spell_learn/context_pointer",
  "icon": "magickcore:context_pointer",
  "category": "magickcore:spell",
  "pages": [
    {
      "type": "text",
      "title": "Three Major Categories of Spell Forms",
      "text": "If you have already digested the previous knowledge, I will now introduce you to the three major classifications of spell $(#DA70D6)forms$(): Projectile, Radiant, and Point forms."
    },
    {
      "type": "text",
      "title": "Projectile Form Spells",
      "text": "Projectile form spells are a type of $(#DA70D6)form$() with high efficiency in magic transfer. One reason is that only projectile form spells can freely move in the world, allowing them to carry subsequent spells to other locations for release. When a projectile form spell touches a block, it releases the subsequent spell on the block. When it touches an entity, it treats the entity as a target and releases the subsequent spell. The $(#EE6363)range$() attribute of the spell slightly increases the volume of projectile form spells."
    },
    {
      "type": "text",
      "text": "Projectile $(#DA70D6)forms$() of spells generally have high magical benefits in terms of $(#00CED1)force$(), which allows them to preserve the desired $(#00CED1)force$() values of the functional spells. This is their advantage. If a projectile $(#DA70D6)form$() is constructed using the self-centered attribute provided by a flawed diamond, it becomes an elemental Spirit that follows the caster and throws itself at surrounding creatures based on $(#00CED1)force$() and $(#EE6363)range$() attributes."
    },
    {
      "type": "text",
      "text": "Furthermore, when a projectile form spell touches a target, it applies a \"touch-type\" flow of magic to the target, providing additional benefits. In addition to projectile form spells, the Spirit Sword also applies a \"touch-type\" flow of magic when it touches entities."
    },
    {
      "type": "text",
      "title": "Radiant Form Spells",
      "text": "Radiant form spells are a stationary $(#EE6363)range$()-based $(#DA70D6)form$() that heavily relies on the $(#EE6363)range$() attribute. They can cast spells within a $(#EE6363)range$() on blocks and entities to transmit targets for subsequent spells. However, after triggering, the radiant form $(#DA70D6)form$() disappears immediately, and its effect on blocks only occurs in the moment of generation. Afterward, it only considers entities within the $(#EE6363)range$(). Most importantly, the $(#00CED1)force$() magical benefits of radiant form spells are only half or less compared to regular $(#DA70D6)forms$(). This makes radiant form spells unable to effectively transmit functional spells that require high $(#00CED1)force$()."
    },
    {
      "type": "text",
      "title": "Point Form Spells",
      "text": "Point form spells are stationary and typically persist for a duration. They have special triggering effects and operating methods and cannot affect blocks directly. Some point $(#DA70D6)forms$() may not have collisions but serve as catalysts for preceding and subsequent spell $(#DA70D6)forms$(). Typically, the $(#00CED1)force$() and duration magical benefits of Point form spells are only one-fifth of the regular values. Therefore, Point form spells are suitable for targets with low mobility and slow movement speed. They compensate for the inability to move and the low magical benefits by releasing spells for an extended period."
    },
    {
      "type": "text",
      "text": "For any $(#DA70D6)form$() spell, the position information transmitted upon triggering is the center of the spell itself. This is crucial, as it means the next $(#DA70D6)form$() spell will be generated at the position of the previous $(#DA70D6)form$(). If we want a $(#DA70D6)form$() to be generated at the target's location, we need to connect it with a projectile $(#DA70D6)form$() and throw it there."
    },
    {
      "type": "text",
      "title": "Form Combinations",
      "text": "Each of the three spell $(#DA70D6)forms$() has different characteristics. We can combine them based on these characteristics to leverage their respective advantages. For point $(#DA70D6)forms$() and radiant $(#DA70D6)forms$(), we can add a projectile $(#DA70D6)form$() in front of them to carry ourselves to other locations. For projectile $(#DA70D6)forms$(), we can add a radiant $(#DA70D6)form$() in front of them to release projectiles at each entity within the radiant range."
    },
    {
      "type": "spotlight",
      "item": "magickcore:entity_type{item_extra_data:{ELEMENT:\"origin\",haveMagickContext:0b,ManaCapacity:{CAPACITY:0.0f,MAX_CAPACITY:5000.0f},FORCE:0.0f,disable:0b,CHILD_CONTEXT:{spawn:{ENTITY_TYPE:\"minecraft:zombie\"}},APPLY_TYPE:\"none\",TICK:0,RANGE:0.0f}}",
      "text": "The essence of spell $(#DA70D6)forms$() is to generate entities using magic, carrying the required magic for subsequent spells' transfer in the world. The magic required by the caster during spellcasting has already been transferred to the spell $(#DA70D6)form$(), so triggering subsequent spells does not consume additional magic. Additionally, there are spell $(#DA70D6)forms$() in this world that can extract $(#DA70D6)forms$() of other creatures and projectiles as spell $(#DA70D6)forms$(), although these creature spell $(#DA70D6)forms$() cannot transmit subsequent spells."
    },
    {
      "type": "text",
      "text": "That concludes the knowledge regarding spell $(#DA70D6)forms$(). When you acquire more spell $(#DA70D6)forms$(), the corresponding knowledge will be unlocked in the book."
    }
  ]
}
