{
  "name": "Context Pointer II Spell Form",
  "advancement": "magickcore:learn/magick_core",
  "icon": "magickcore:context_pointer",
  "category": "magickcore:spell",
  "pages": [
    {
      "type": "spotlight",
      "title": "Mana Arrow spell form",
      "item": "magickcore:entity_type{item_extra_data:{ELEMENT:\"origin\",haveMagickContext:0b,ManaCapacity:{CAPACITY:0.0f,MAX_CAPACITY:5000.0f},FORCE:0.0f,disable:0b,CHILD_CONTEXT:{spawn:{ENTITY_TYPE:\"magickcore:arrow\"}},APPLY_TYPE:\"none\",TICK:0,RANGE:0.0f}}",
      "text": "Spell form carries post spells, also release by post spells."
    },
    {
      "type": "spotlight",
      "item": "magickcore:spirit_bow{item_extra_data:{ELEMENT:\"origin\",haveMagickContext:0b,ManaCapacity:{CAPACITY:0.0f,MAX_CAPACITY:5000.0f},RANGE:5.0f,POST:{ELEMENT:\"origin\",FORCE:5.0f,POST:{},CHILD_CONTEXT:{},APPLY_TYPE:\"attack\",TICK:0,RANGE:0.0f},disable:0b,CHILD_CONTEXT:{spawn:{ENTITY_TYPE:\"magickcore:sphere\"}},APPLY_TYPE:\"spawn_entity\",TICK:120,RANGE:3.0f}}",
      "text": "From previous study we can know, Spell Form as the special Apply Type, can carries post spells, and transfer target, direction, position etc. What would be happend if we use spell form to connect spell form? $(br2)For example, using a compound spell starting with a sphere radiation on a spirit bow."
    },
    {
      "type": "text",
      "text": "Sphere radiation is a form of radiation-type spell, which captures targets within its range and triggers the next stage of magick before disappearing.$(br)$(t:Raising these values of the form can increase the profit)$(li)$(#6C7B8B)Growth Needs：$(/t)$(t:Increasing the Range of the form can increase the profit)$(li2)$(#EE6363)Range$(/t)$()$(br)$(t:Effect of Spell Attributes on Functional Spells)$(li)$(#6C7B8B)Magical Efficacy：$(/t)$(t:Functional spells will have their strength bonus reduced to 0.2)$(li2)$(#00CED1)Force：0.2$(/t)$()$(t:The range of functional spells is not affected)$(li2)$(#EE6363)Range：1.0$(/t)$()$(t:The duration of functional spells is not affected)$(li2)$(#FFB90F)Duration：1.0$(/t)$()"
    },
    {
      "type": "text",
      "text": "Before answering this question, we need to know that in compound spells, the starting spell form is generated in response to the flow of mana of the caster, can transfer the caster's position and sight direction, then the spell form of the post spells will naturally correspond to the spell form of the starting form, and will be generated according to the position and direction of the starting form. $(br2)If more forms are connected post, it will also produce the effect corresponding to the state of the previous spell form, the direction points to the direction given by the previous form, and the position is at the position of the previous form."
    },
    {
      "type": "text",
      "text": "We can now infer that using a sphere radiation as the starting point and a compound spell as the attack type on a Spirit Bow, the bow itself will generate a mana arrow, which will trigger the sphere radiation of the compound spell when it touches a target. $(br2)The sphere radiation is generated based on the position and direction of the mana arrow and delivers the attack spell to the entities within the radiation range."
    },
    {
      "type": "text",
      "text": "It is important to note that a spell form has the property of magical efficacy, which affects the attributes of functional spells. For example, the strength capability of a spherical radiation form is 0.2, which means that the intensity effect of the subsequent spell triggered by the functional spell carried by the spherical radiation form and connected to it will be multiplied by 0.2. This means that the spell strength of the spells connected to the spherical radiation will be reduced."
    },
    {
      "type": "text",
      "text": "The magical efficacy of sphere radiation.$(br2)$(t:Effect of Spell Attributes on Functional Spells)$(li)$(#6C7B8B)Magical Efficacy：$(/t)$(t:Functional spells will have their force bonus reduced to 0.2)$(li2)$(#00CED1)Force：0.2$(/t)$()$(t:The range of functional spells is not affected)$(li2)$(#EE6363)Range：1.0$(/t)$()$(t:The duration of functional spells is not affected)$(li2)$(#FFB90F)Duration：1.0$(/t)$()"
    },
    {
      "type": "spotlight",
      "item": "magickcore:spirit_bow{item_extra_data:{APPLY_TYPE:\"spawn_entity\",CHILD_CONTEXT:{spawn:{ENTITY_TYPE:\"magickcore:sphere\"}},ELEMENT:\"origin\",FORCE:0.0f,ManaCapacity:{CAPACITY:0.0f,MAX_CAPACITY:50000.0f},POST:{APPLY_TYPE:\"spawn_entity\",CHILD_CONTEXT:{spawn:{ENTITY_TYPE:\"magickcore:mana_orb\"}},ELEMENT:\"origin\",FORCE:5.0f,POST:{APPLY_TYPE:\"attack\",CHILD_CONTEXT:{},ELEMENT:\"origin\",FORCE:5.0f,POST:{},RANGE:0.0f,TICK:0},RANGE:0.0f,TICK:120},RANGE:3.0f,TICK:120,disable:0b,haveMagickContext:0b}}",
      "text": "However, we can avoid the side effect of lowering spell force by linking with a high strength spell form. For example, if we link the Mana Orb form after the Sphere Radiation form and use it to release the attack spell, according to the Mana Orb's force of 1.0, it can perfectly transmit the attack spell's force of 5.0."
    },
    {
      "type": "text",
      "text": "Mana Orb is a kind of projectile-type form。$(br)$(t:Effect of Spell Attributes on Functional Spells)$(li)$(#6C7B8B)Magical Efficacy：$(/t)$(t:The force of functional spells is not affected)$(li2)$(#00CED1)Force：1.0$(/t)$()$(t:The range of functional spells is not affected)$(li2)$(#EE6363)Range：1.0$(/t)$()$(t:The duration of functional spells is not affected)$(li2)$(#FFB90F)Duration：1.0$(/t)$()$(br2)"
    },
    {
      "type": "text",
      "text": "One more thing to note is that increasing some attributes of the form spell can provide additional benefits. For example, increasing the range attributes of the radiation form can increase the radiation range. Increasing the range attributes of the mana arrow can increase the speed of the magic arrow.$(br)Growth Needs for Mana Arrow。$(br)$(t:Raising these values of the form can increase the profit)$(li)$(#6C7B8B)Growth Needs：$(/t)$(t:Increasing the Range of the form can increase the profit)$(li2)$(#EE6363)Range$(/t)$()$(br2)The range attribute affects the maximum speed value of the mana arrow."
    }
  ]
}